app/controllers/categories_controller.rb

  def index
    @category = Category.all
---
SELECT "categories".* FROM "categories"

  def create
    @category = Category.create(category_params)
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Study"], ["created_at", "2020-04-13 02:56:41.774634"], ["updated_at", "2020-04-13 02:56:41.774634"]]

  def show
    @category = Category.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]