app/controllers/days_controller.rb

  def index
    @days = Day.all
---
SELECT "days".* FROM "days"

  def create
    @day = Day.create(day_params)
---
INSERT INTO "days" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Monday"], ["created_at", "2020-04-13 02:49:24.940695"], ["updated_at", "2020-04-13 02:49:24.940695"]]

  def show
    @day = Day.find(params[:id])
---
SELECT "days".* FROM "days" WHERE "days"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]