app/controllers/todo_items_controller.rb

SELECT "todo_items".* FROM "todo_items"
---
  def index
    @todo_items = TodoItem.all

SELECT "categories".* FROM "categories"
SELECT "days".* FROM "days"
---
  def new
    @todo_item = TodoItem.new
    @categories = Category.all
    @days = Day.all

INSERT INTO "todo_items" ("title", "description", "category_id", "day_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @todo_item = TodoItem.create(todo_item_params)

SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"
SELECT "days".* FROM "days"
---
  def edit
    @todo_item = TodoItem.find(params[:id])
    @categories = Category.all
    @days = Day.all

SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "todo_items" SET "title" = ?, "category_id" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["title", "Do Laundry"], ["category_id", 4], ["updated_at", "2020-04-14 05:21:40.964793"], ["id", 1]]
---
  def update
    @todo_item = TodoItem.find(params[:id])
    @todo_item.update(todo_item_params)

SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "todo_items".* FROM "todo_items"
---
  def show
    @todo_item = TodoItem.find(params[:id])
    @todo_items = TodoItem.all

SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 3]]
---
  def destroy
    @todo_items = TodoItem.all
    @todo_item = TodoItem.find(params[:id])
    @todo_item.destroy